# **`Lab3 - Data Engineering & EDA with Python, SQL, and Pandas`**

##### **Name** - Manu Mathew
##### **CourseID** - PROG8245
##### **Course** - Machine Learning Programming
##### **Student ID** - 8990691

---

**Install required packages**

In [27]:
%pip install psycopg2-binary pandas faker sqlalchemy

Requirement already satisfied: psycopg2-binary in ./.venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: faker in ./.venv/lib/python3.13/site-packages (37.3.0)
Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.13/site-packages (2.0.41)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

`1 -- `
- Create a free SQL Database
- Create a table named employees with the following columns:
    - employee_id (integer, primary key)
    - name (string)
    - position (string, IT-related job titles)
    - start_date (date, between 2015 and 2024)
    - salary (integer, $60,000â€“$200,000)`

I have set up a Postgres database and also I have created the SQL table using the below SQL query

```SQL
CREATE TABLE employees (
  employee_id SERIAL PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  start_date DATE,
  salary INTEGER
);

**Adding the imports**

In [28]:
import random
from faker import Faker
from datetime import date
import pandas as pd
# import psycopg2
from sqlalchemy import create_engine

`2 --`
- Generate & Populate Data
    - Generate at least 50 synthetic records using Python and the Faker library.
    - Insert the data into your cloud database.

In [29]:
# Initializes faker object from the Faker library
fake = Faker()
# Position list that can be assigned randomly to employees
positions = ['Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer','Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist']
# Running a loop for 100 iterations
for i in range(100):
    # Replace single quote with double quotes
    name = fake.name().replace("'", "''")
    # Select random position for the employee
    position = random.choice(positions)
    # Select any date in the year between 2015 and 2024
    start_date = fake.date_between(start_date=date(2015,1,1), end_date=date(2024,6,1))
    # Select an integer between 60000 and 200000
    salary = random.randint(60000, 200000)
    # print 100 SQL insert queries
    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES('Amy Lucero', 'Frontend Developer', '2020-07-11', 188025);
INSERT INTO employees (name, position, start_date, salary) VALUES('Patrick Cook', 'Backend Developer', '2017-10-30', 178056);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lindsey Curtis', 'Data Scientist', '2020-04-13', 115095);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mr. Jonathan Wilson', 'SysAdmin', '2022-04-10', 150766);
INSERT INTO employees (name, position, start_date, salary) VALUES('Douglas Andrews', 'Cloud Architect', '2019-09-15', 156137);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kathleen Riley', 'Cloud Architect', '2022-05-26', 154169);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Davis', 'DevOps Engineer', '2016-07-09', 142068);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jack Brown', 'Data Analyst', '2020-06-25', 80890);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Villegas', 'Cloud Architect', '2016-02-17', 104415);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alex Davis', 'Frontend Developer', '2023-02-09', 157627);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jenna Bernard', 'DevOps Engineer', '2019-10-16', 72295);
INSERT INTO employees (name, position, start_date, salary) VALUES('Susan Williams', 'Cloud Architect', '2023-06-08', 132665);
INSERT INTO employees (name, position, start_date, salary) VALUES('Douglas Reed', 'Data Scientist', '2021-10-30', 99129);
INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Gibbs', 'Data Scientist', '2019-10-30', 106844);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melissa Fuller', 'SysAdmin', '2019-01-09', 72186);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jerry Parker', 'Cloud Architect', '2023-11-08', 186200);
INSERT INTO employees (name, position, start_date, salary) VALUES('Anna Pope', 'Software Engineer', '2021-12-03', 161778);
INSERT INTO employees (name, position, start_date, salary) VALUES('Leon Costa', 'Cloud Architect', '2018-11-30', 77138);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alexis Kim', 'ML Engineer', '2015-11-19', 122108);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christine Cabrera', 'QA Engineer', '2023-09-19', 148481);
INSERT INTO employees (name, position, start_date, salary) VALUES('Maria Cooper', 'ML Engineer', '2015-06-23', 112561);
INSERT INTO employees (name, position, start_date, salary) VALUES('Linda Price', 'Data Scientist', '2017-06-04', 69240);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sara Warner', 'Data Scientist', '2019-03-28', 181752);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Patterson', 'Frontend Developer', '2015-03-04', 100740);
INSERT INTO employees (name, position, start_date, salary) VALUES('Julie Wallace', 'QA Engineer', '2015-10-21', 147564);
INSERT INTO employees (name, position, start_date, salary) VALUES('Catherine Shea', 'Software Engineer', '2016-08-08', 173874);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Allison', 'Cloud Architect', '2019-06-11', 108687);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Dalton', 'QA Engineer', '2023-05-26', 77489);
INSERT INTO employees (name, position, start_date, salary) VALUES('Hector Davis', 'ML Engineer', '2023-04-21', 96225);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Snyder', 'Cloud Architect', '2018-08-28', 156409);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stephanie Grimes', 'Data Analyst', '2022-08-07', 160918);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sheila Parker', 'Frontend Developer', '2022-03-09', 113372);
INSERT INTO employees (name, position, start_date, salary) VALUES('Andrea Price', 'Backend Developer', '2018-04-21', 88756);
INSERT INTO employees (name, position, start_date, salary) VALUES('Danny Parker', 'Data Analyst', '2015-11-20', 151739);
INSERT INTO employees (name, position, start_date, salary) VALUES('Russell Williams', 'Backend Developer', '2018-02-27', 104234);
INSERT INTO employees (name, position, start_date, salary) VALUES('Terrance Villanueva', 'ML Engineer', '2023-12-23', 174742);
INSERT INTO employees (name, position, start_date, salary) VALUES('James Yoder', 'Data Analyst', '2022-02-13', 65168);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dakota Perry', 'Data Scientist', '2019-02-09', 146127);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kelsey Rangel', 'QA Engineer', '2018-01-31', 69355);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ray Anderson', 'Frontend Developer', '2021-01-19', 106590);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Vargas', 'Data Scientist', '2019-05-31', 156926);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mr. Scott Simpson', 'Data Analyst', '2023-06-06', 124548);
INSERT INTO employees (name, position, start_date, salary) VALUES('Chad Gill', 'Frontend Developer', '2015-09-02', 91464);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Rosales', 'SysAdmin', '2022-11-24', 169927);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laurie Estrada', 'QA Engineer', '2023-03-04', 127979);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Vincent', 'Data Scientist', '2021-02-15', 192259);
INSERT INTO employees (name, position, start_date, salary) VALUES('Wayne Noble', 'Data Analyst', '2020-06-18', 150303);
INSERT INTO employees (name, position, start_date, salary) VALUES('Benjamin Smith', 'Frontend Developer', '2016-10-12', 126428);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicole Nguyen', 'Cloud Architect', '2016-02-09', 65708);
INSERT INTO employees (name, position, start_date, salary) VALUES('William Ho', 'Data Analyst', '2016-10-07', 157078);
INSERT INTO employees (name, position, start_date, salary) VALUES('Samuel Hanson', 'Software Engineer', '2021-03-21', 168014);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melissa Hernandez', 'Cloud Architect', '2021-12-10', 183443);
INSERT INTO employees (name, position, start_date, salary) VALUES('Keith Bonilla', 'QA Engineer', '2023-10-29', 71228);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melissa Phelps', 'Software Engineer', '2020-05-24', 101822);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Johnson', 'Software Engineer', '2023-04-09', 189393);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Carroll', 'Backend Developer', '2023-04-26', 102411);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kristi Johnson', 'Data Scientist', '2021-11-30', 188602);
INSERT INTO employees (name, position, start_date, salary) VALUES('Donna Crawford', 'Data Scientist', '2019-09-07', 107647);
INSERT INTO employees (name, position, start_date, salary) VALUES('Adam Williams', 'ML Engineer', '2019-05-14', 198049);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Hartman', 'Frontend Developer', '2022-05-20', 165535);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amber Obrien', 'Frontend Developer', '2018-07-03', 186986);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amanda King', 'ML Engineer', '2017-06-21', 103130);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Avila', 'Cloud Architect', '2022-12-13', 125785);
INSERT INTO employees (name, position, start_date, salary) VALUES('Paige Potts', 'Software Engineer', '2020-02-16', 135712);
INSERT INTO employees (name, position, start_date, salary) VALUES('Andrea Burgess', 'Backend Developer', '2016-03-06', 105071);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jacqueline Cruz', 'Software Engineer', '2018-05-23', 64860);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sandra Sanchez MD', 'QA Engineer', '2020-07-12', 188705);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lauren Carroll', 'ML Engineer', '2021-04-25', 149565);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeremy Hoffman', 'Data Analyst', '2020-03-15', 135940);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Hughes', 'DevOps Engineer', '2017-08-06', 75204);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dr. Jacob Munoz Jr.', 'DevOps Engineer', '2023-08-26', 181122);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jacqueline Shaw', 'SysAdmin', '2016-07-27', 166561);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stephanie Brown', 'Cloud Architect', '2021-03-19', 93130);
INSERT INTO employees (name, position, start_date, salary) VALUES('Donna Parrish', 'QA Engineer', '2022-09-14', 83790);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mary Atkinson', 'Software Engineer', '2018-03-17', 133647);
INSERT INTO employees (name, position, start_date, salary) VALUES('Marc Woods', 'Cloud Architect', '2022-11-07', 76408);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christy Green', 'Data Scientist', '2019-05-09', 143503);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tina Shaw', 'Software Engineer', '2021-12-22', 185900);
INSERT INTO employees (name, position, start_date, salary) VALUES('Allen Wright', 'Software Engineer', '2023-11-13', 190752);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeffery Bryant', 'QA Engineer', '2020-09-21', 87616);
INSERT INTO employees (name, position, start_date, salary) VALUES('Benjamin Carroll', 'Cloud Architect', '2020-01-01', 121935);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lisa Coleman', 'Data Scientist', '2020-07-13', 199002);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lucas Miranda', 'DevOps Engineer', '2020-07-25', 113022);
INSERT INTO employees (name, position, start_date, salary) VALUES('Billy Harris', 'Data Scientist', '2021-11-16', 90252);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mr. Thomas Kelly', 'ML Engineer', '2022-07-07', 121671);
INSERT INTO employees (name, position, start_date, salary) VALUES('Julie Weaver', 'ML Engineer', '2023-02-03', 71436);
INSERT INTO employees (name, position, start_date, salary) VALUES('Natalie Ramsey', 'DevOps Engineer', '2016-12-22', 69723);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Porter', 'Data Scientist', '2018-04-09', 104448);
INSERT INTO employees (name, position, start_date, salary) VALUES('James Dodson', 'Data Analyst', '2022-12-22', 99106);
INSERT INTO employees (name, position, start_date, salary) VALUES('Haley Ross', 'ML Engineer', '2016-12-27', 67196);
INSERT INTO employees (name, position, start_date, salary) VALUES('Deborah Fitzpatrick', 'Backend Developer', '2016-09-01', 166963);
INSERT INTO employees (name, position, start_date, salary) VALUES('Shawn Rodriguez MD', 'ML Engineer', '2021-01-09', 166307);
INSERT INTO employees (name, position, start_date, salary) VALUES('Crystal Underwood', 'Backend Developer', '2018-07-08', 112579);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christine Cooper', 'Software Engineer', '2019-02-23', 127248);
INSERT INTO employees (name, position, start_date, salary) VALUES('Zachary Blair', 'QA Engineer', '2022-06-03', 63552);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mary Sanchez', 'Software Engineer', '2023-11-23', 117127);
INSERT INTO employees (name, position, start_date, salary) VALUES('Caroline Williams', 'Data Scientist', '2021-11-03', 156014);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brittney Keller', 'Data Scientist', '2023-04-24', 125665);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laurie Mclaughlin', 'Data Scientist', '2023-01-09', 115468);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Mcgee', 'Frontend Developer', '2016-09-07', 161599);

`3--`
- Connect and Load Data
- Using Python, psycopg2, and Pandas, connect to your cloud database.
- Query the entire employee table and load the data into a Pandas DataFrame.
- Display the first few rows using df.head().

In [30]:
# Connection string
conn_str = "postgresql://neondb_owner:npg_Ppd3S2nUcWfx@ep-steep-rain-a8s0cnp2-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"
# Create SQLAlchemy engine
engine = create_engine(conn_str)
# Query entire employee table and load the data into the dataframe
df = pd.read_sql_query("SELECT * FROM employees;", engine)
# Display the first few records , showing the first 50 records
print(df.head(50))
# Close the engine
engine.dispose()

    employee_id                   name            position  start_date  salary
0             1      Zachary Rogers MD            SysAdmin  2024-01-31  164268
1             2      Francis Castaneda        Data Analyst  2023-04-09   92677
2             3            Oscar Davis      Data Scientist  2019-02-12  114123
3             4            David Brown   Software Engineer  2021-05-11  183617
4             5         Corey Campbell            SysAdmin  2023-07-04   64790
5             6  Dr. Kyle Martinez DDS         ML Engineer  2017-01-11   86908
6             7        Kristin Russell         ML Engineer  2016-12-07   68990
7             8         Patricia Gates   Backend Developer  2018-04-02  140714
8             9          Kelly Carlson            SysAdmin  2019-12-18  107035
9            10        Samantha Hardin     DevOps Engineer  2016-11-04  198378
10           11           Brian Newman         ML Engineer  2019-09-07   94029
11           12      Mikayla Dickerson         ML Engineer  2020-06-20  171252
12           13          Robert Wilson   Backend Developer  2016-11-27   96765
13           14         Zachary Taylor            SysAdmin  2019-03-19  172969
14           15            Brooke Rice            SysAdmin  2015-06-06  114391
15           16          Ashley Arnold            SysAdmin  2021-02-24   85972
16           17            Amber Gould      Data Scientist  2015-01-22  142882
17           18       Christopher Diaz        Data Analyst  2016-06-05  187503
18           19        Travis Marshall   Software Engineer  2015-11-19  122830
19           20              Beth Hart     Cloud Architect  2017-05-28  156517
20           21        Brian Rodriguez     DevOps Engineer  2020-10-29  108627
21           22          Karen Nichols     Cloud Architect  2020-05-18  126015
22           23            Alan Garcia     DevOps Engineer  2020-09-04  124212
23           24           Ryan Winters        Data Analyst  2018-02-25  147986
24           25          Shelby Taylor      Data Scientist  2016-02-11  180404
25           26        Elizabeth Smith     Cloud Architect  2019-09-21   60200
26           27            Marvin Wood     DevOps Engineer  2016-05-05  184470
27           28            Sharon Hall            SysAdmin  2016-11-13  111090
28           29         Tracie Salazar     DevOps Engineer  2019-06-11  194233
29           30            Chris Smith         ML Engineer  2022-05-28  161000
30           31          Todd Anderson      Data Scientist  2020-10-01  104828
31           32           Brandi Casey   Backend Developer  2015-09-11  148238
32           33           Debra Davies  Frontend Developer  2015-04-19   83147
33           34    Samantha Oliver DDS      Data Scientist  2018-07-22   96135
34           35        Christina Floyd  Frontend Developer  2022-02-17  145760
35           36           Luke Griffin         ML Engineer  2019-11-27   88537
36           37           Sara Stewart        Data Analyst  2023-12-05   72123
37           38           Shirley Hart     Cloud Architect  2015-10-19  111158
38           39          Cynthia Reyes   Backend Developer  2019-11-27  102843
39           40           Adam Johnson        Data Analyst  2021-02-23   69521
40           41      Christina Gardner     DevOps Engineer  2022-03-25  172320
41           42           Anna Pittman  Frontend Developer  2023-12-04  198157
42           43             Juan Brown   Backend Developer  2015-06-21  151509
43           44           Brian Levine     Cloud Architect  2015-06-08  111293
44           45         Allison Miller            SysAdmin  2023-11-11  188380
45           46            Sherry Holt        Data Analyst  2018-09-01  169029
46           47          Larry Douglas        Data Analyst  2021-02-05  136119
47           48           Terry Harris     Cloud Architect  2023-03-11  190637
48           49             Seth Chang   Backend Developer  2018-08-18  107043
49           50           Deborah Ford  Frontend Developer  2020-10-04  130907

`3--`
**Explain each EDA step**

**Data Collection**

**`Database Setup and data collection`**
- Go to https://neon.tech/
- Sign up with your GitHub or Google account
- After logging in, click `Create a project`
- Set the project name.
- Choose any region and click `CreateProject`
- Once in the project dashboard page, click on the `connect` button on top right side.
- Copy the connection string
- Select the SQLEditor option , and then copy the SQL query below to create the employees table
- ```SQL
    CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    position VARCHAR(50),
    start_date DATE,
    salary INTEGER
    );
- Generate 100 asynthetic records using Python and the Faker library. We generate 100 INSERT queries and copy the insert queries.
- Go to project dashboard page and then selected `SQLEditor` and then executed the 100 INSERT queries to insert the data into the cloud database.

**Data Cleaning**
- I checked for the missing values and I could find that there were no null or empty values present. This was checked using the command `df.info()`
- Also the data types for each columns names were correct as per the requirement using the command `df.info()`

In [31]:
# Column types and null counts
df.info()

# Check for the missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  200 non-null    int64
 1   name         200 non-null    object
 2   position     200 non-null    object
 3   start_date   200 non-null    object
 4   salary       200 non-null    int64
dtypes: int64(2), object(3)
memory usage: 7.9+ KB

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

**Data Transformation**
- As part of data transformation , I have created a new column `years_of_service` by calculating the difference between the current date and the sart_date

In [ ]:
df['years_of_service'] = date.today().year - pd.DatetimeIndex(df['start_date']).year
df.head()

,employee_id,name,position,start_date,salary,years_service
0,1,Zachary Rogers MD,SysAdmin,2024-01-31,164268,1
1,2,Francis Castaneda,Data Analyst,2023-04-09,92677,2
2,3,Oscar Davis,Data Scientist,2019-02-12,114123,6
3,4,David Brown,Software Engineer,2021-05-11,183617,4
4,5,Corey Campbell,SysAdmin,2023-07-04,64790,2